<?php  return array (
  'area_msof_main' => 'Основные',
  'area_msof_frontend' => 'Фронт-энд',
  'setting_msof_source' => 'Источник файлов по умолчанию',
  'setting_msof_source_desc' => 'Если не указать, то будет использован стандартный источник файлов MODX из настройки <b>default_media_source</b>.',
  'setting_msof_frontend_js' => 'JS фронтенда',
  'setting_msof_frontend_js_desc' => 'Путь к JS файлу компонента. Если вы хотите использовать собственные скрипты - укажите путь к ним здесь, или очистите параметр и загрузите их вручную через шаблон сайта.',
  'setting_msof_frontend_css' => 'CSS фронтенда',
  'setting_msof_frontend_css_desc' => 'Путь к CSS файлу компонента. Если вы хотите использовать собственные стили - укажите путь к ним здесь, или очистите параметр и загрузите их вручную через шаблон сайта.',
  'msof_source_allowedFileTypes_desc' => 'Список расширений файлов, которые разрешается загружать. Указывается через запятую. Например: jpg,jpeg,png,gif',
  'msof_source_maxFileSize_desc' => 'Максимальный размер загружаемого файла (в байтах).',
  'msof_source_fileNameType_desc' => 'Как нужно переименовать файл при загрузке.<br><b>Hash</b> - это генерация уникального имени, в зависимости от содержимого файла.<br><b>Friendly</b> - генерация имени по алгоритму дружественных url страниц сайта (они управляются системными настройками).',
  'msof_source_positionNewFiles_desc' => 'Позиция новых файлов в списке.<br><b>В начало</b> - новые файлы будут становиться первыми в списке.<br><b>В конец</b> - новые файлы будут становиться последними в списке.',
);